Revit 2027 API
BaseImportOptions.SetLayerSelection Method
 Set the layers name which user want to import into Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayerSelection(
	ICollection<string> layerSelection
)
Public Sub SetLayerSelection (
	layerSelection As ICollection(Of String)
)
public:
void SetLayerSelection(
	ICollection<String^>^ layerSelection
)
member SetLayerSelection :
        layerSelection : ICollection<string> -> unit
Parameters
layerSelection ICollection<String>
 The layers imported into Revit.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If user don't set any layer selection, all layers would be imported into Revit for dgn. But for dwg|dxf, all layers (or visible layers, it is up to visibleLayersOnly was set or not) would be imported into Revit.
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace